RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc556x.h
                uint32_t BW0:1;        /* EMIOS */
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;

                  uint32_t:28;
            } B;
        } OPACR1;

        union {
            uint32_t R;
            struct {
                uint32_t BW0:1;
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                  uint32_t:4;
                uint32_t BW2:1;
                uint32_t SP2:1;
                uint32_t WP2:1;
                uint32_t TP2:1;
                uint32_t BW3:1;
                uint32_t SP3:1;
                uint32_t WP3:1;
                uint32_t TP3:1;
                uint32_t BW4:1;
                uint32_t SP4:1;
                uint32_t WP4:1;
                uint32_t TP4:1;
                  uint32_t:12;
            } B;
        } OPACR2;

    };

/****************************************************************************/
/*                          MODULE : PBRIDGE_B Peripheral Bridge            */
/****************************************************************************/
    struct PBRIDGE_B_tag {
        union {
            uint32_t R;
            struct {
                uint32_t MBW0:1;
                uint32_t MTR0:1;
                uint32_t MTW0:1;
                uint32_t MPL0:1;
                uint32_t MBW1:1;
                uint32_t MTR1:1;
                uint32_t MTW1:1;
                uint32_t MPL1:1;
                uint32_t MBW2:1;
                uint32_t MTR2:1;
                uint32_t MTW2:1;
                uint32_t MPL2:1;
                uint32_t MBW3:1;
                uint32_t MTR3:1;
                uint32_t MTW3:1;
                uint32_t MPL3:1;

                uint32_t MBW4:1;       /* FEC */
                uint32_t MTR4:1;
                uint32_t MTW4:1;
                uint32_t MPL4:1;

                  uint32_t:4;

                uint32_t MBW6:1;       /* FLEXRAY */
                uint32_t MTR6:1;
                uint32_t MTW6:1;
                uint32_t MPL6:1;

                  uint32_t:4;
            } B;
        } MPCR;                 /* Master Privilege Control Register */

        uint32_t pbridge_b_reserved2[7];

        union {
            uint32_t R;
            struct {
                uint32_t BW0:1;
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                uint32_t BW1:1;
                uint32_t SP1:1;
                uint32_t WP1:1;
                uint32_t TP1:1;
                  uint32_t:24;
            } B;
        } PACR0;

        uint32_t pbridge_b_reserved3;

        union {
            uint32_t R;
            struct {
                uint32_t BW0:1;
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                uint32_t BW1:1;
                uint32_t SP1:1;
                uint32_t WP1:1;
                uint32_t TP1:1;
                uint32_t BW2:1;
                uint32_t SP2:1;
                uint32_t WP2:1;
                uint32_t TP2:1;

                uint32_t BW3:1;        /* FEC */
                uint32_t SP3:1;
                uint32_t WP3:1;
                uint32_t TP3:1;

                  uint32_t:16;

            } B;
        } PACR2;

        uint32_t pbridge_b_reserved4[5];

        union {
            uint32_t R;
            struct {
                uint32_t BW0:1;
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                  uint32_t:12;

                  uint32_t:4;

                uint32_t BW5:1;        /* DSPI_B */
                uint32_t SP5:1;
                uint32_t WP5:1;
                uint32_t TP5:1;

                uint32_t BW6:1;
                uint32_t SP6:1;
                uint32_t WP6:1;
                uint32_t TP6:1;
                uint32_t BW7:1;
                uint32_t SP7:1;
                uint32_t WP7:1;
                uint32_t TP7:1;
            } B;
        } OPACR0;

        union {
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t BW4:1;
                uint32_t SP4:1;
                uint32_t WP4:1;
                uint32_t TP4:1;

                uint32_t BW5:1;        /* ESCI_B */
                uint32_t SP5:1;
                uint32_t WP5:1;
                uint32_t TP5:1;

                  uint32_t:8;
            } B;
        } OPACR1;

        union {
            uint32_t R;
            struct {
                uint32_t BW0:1;
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;

                uint32_t BW1:1;        /* CAN_B */
                uint32_t SP1:1;
                uint32_t WP1:1;
                uint32_t TP1:1;

                uint32_t BW2:1;
                uint32_t SP2:1;
                uint32_t WP2:1;
                uint32_t TP2:1;

                uint32_t BW3:1;        /* CAN_D */
                uint32_t SP3:1;
                uint32_t WP3:1;
                uint32_t TP3:1;

                uint32_t BW4:1;        /* CAN_E */
                uint32_t SP4:1;
                uint32_t WP4:1;
                uint32_t TP4:1;

                  uint32_t:12;
            } B;
        } OPACR2;

        union {
            uint32_t R;
            struct {

                uint32_t BW0:1;        /* FLEXRAY */
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;

                  uint32_t:24;
                uint32_t BW7:1;
                uint32_t SP7:1;
                uint32_t WP7:1;
                uint32_t TP7:1;
            } B;
        } OPACR3;

    };
/****************************************************************************/
/*                     MODULE : FMPLL                                       */
/****************************************************************************/
    struct FMPLL_tag {
        union FMPLL_SYNCR_tag {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t PREDIV:3;
                uint32_t MFD:5;
                  uint32_t:1;
                uint32_t RFD:3;
                uint32_t LOCEN:1;
                uint32_t LOLRE:1;
                uint32_t LOCRE:1;
                uint32_t DISCLK:1;
                uint32_t LOLIRQ:1;
                uint32_t LOCIRQ:1;
                uint32_t RATE:1;
                uint32_t DEPTH:2;
                uint32_t EXP:10;
            } B;
        } SYNCR;

        union FMPLL_SYNSR_tag {
            uint32_t R;
            struct {
                uint32_t:22;
                uint32_t LOLF:1;
                uint32_t LOC:1;
                uint32_t MODE:1;
                uint32_t PLLSEL:1;
                uint32_t PLLREF:1;
                uint32_t LOCKS:1;
                uint32_t LOCK:1;
                uint32_t LOCF:1;
                uint32_t CALDONE:1;
                uint32_t CALPASS:1;
            } B;
        } SYNSR;

