RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc556x.h
    };
/****************************************************************************/
/*                     MODULE : External Bus Interface (EBI)                */
/****************************************************************************/
    struct EBI_CS_tag {
        union {                 /* Base Register Bank */
            uint32_t R;
            struct {
                uint32_t BA:17;
                  uint32_t:3;
                uint32_t PS:1;
                  uint32_t:4;
                uint32_t BL:1;
                uint32_t WEBS:1;
                uint32_t TBDIP:1;
                  uint32_t:2;
                uint32_t BI:1;
                uint32_t V:1;
            } B;
        } BR;

        union {                 /* Option Register Bank */
            uint32_t R;
            struct {
                uint32_t AM:17;
                  uint32_t:7;
                uint32_t SCY:4;
                  uint32_t:1;
                uint32_t BSCY:2;
                  uint32_t:1;
            } B;
        } OR;
    };

    struct EBI_CAL_CS_tag {
        union {                 /* Calibration Base Register Bank */
            uint32_t R;
            struct {
                uint32_t BA:17;
                  uint32_t:3;
                uint32_t PS:1;
                  uint32_t:4;
                uint32_t BL:1;
                uint32_t WEBS:1;
                uint32_t TBDIP:1;
                  uint32_t:2;
                uint32_t BI:1;
                uint32_t V:1;
            } B;
        } BR;

        union {                 /* Calibration Option Register Bank */
            uint32_t R;
            struct {
                uint32_t AM:17;
                  uint32_t:7;
                uint32_t SCY:4;
                  uint32_t:1;
                uint32_t BSCY:2;
                  uint32_t:1;
            } B;
        } OR;
    };

    struct EBI_tag {
        union EBI_MCR_tag {     /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t:5;
                uint32_t SIZEEN:1;
                uint32_t SIZE:2;
                  uint32_t:8;
                uint32_t ACGE:1;
                uint32_t EXTM:1;
                uint32_t EARB:1;
                uint32_t EARP:2;
                  uint32_t:4;
                uint32_t MDIS:1;
                  uint32_t:5;
                uint32_t DBM:1;
            } B;
        } MCR;

        uint32_t EBI_reserved1;

        union {                 /* Transfer Error Status Register */
            uint32_t R;
            struct {
                uint32_t:30;
                uint32_t TEAF:1;
                uint32_t BMTF:1;
            } B;
        } TESR;

        union {                 /* Bus Monitor Control Register */
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t BMT:8;
                uint32_t BME:1;
                  uint32_t:7;
            } B;
        } BMCR;

        struct EBI_CS_tag CS[4];

/* Calibration registers */
        uint32_t EBI_reserved2[4];
        struct EBI_CAL_CS_tag CAL_CS[4];

    };
/****************************************************************************/
/*                     MODULE : FLASH                                       */
/****************************************************************************/
    struct FLASH_tag {
        union {                 /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t:4;
                uint32_t SIZE:4;
                  uint32_t:1;
                uint32_t LAS:3;
                  uint32_t:3;
                uint32_t MAS:1;
                uint32_t EER:1;
                uint32_t RWE:1;
                uint32_t BBEPE:1;
                uint32_t EPE:1;
                uint32_t PEAS:1;
                uint32_t DONE:1;
                uint32_t PEG:1;

                  uint32_t:2;

                uint32_t STOP:1;
                  uint32_t:1;
                uint32_t PGM:1;
                uint32_t PSUS:1;
                uint32_t ERS:1;
                uint32_t ESUS:1;
                uint32_t EHV:1;
            } B;
        } MCR;

        union LMLR_tag {        /* LML Register */
            uint32_t R;
            struct {
                uint32_t LME:1;
                  uint32_t:10;
                uint32_t SLOCK:1;
                uint32_t MLOCK:4;
                uint32_t LLOCK:16;
            } B;
        } LMLR;

        union HLR_tag {         /* HL Register */
            uint32_t R;
            struct {
                uint32_t HBE:1;
                  uint32_t:3;
                uint32_t HBLOCK:28;
            } B;
        } HLR;

        union SLMLR_tag {       /* SLML Register */
            uint32_t R;
            struct {
                uint32_t SLE:1;
                  uint32_t:10;
                uint32_t SSLOCK:1;
                uint32_t SMLOCK:4;
                uint32_t SLLOCK:16;
            } B;
        } SLMLR;

        union {                 /* LMS Register */
            uint32_t R;
            struct {
                uint32_t:12;
                uint32_t MSEL:4;
                uint32_t LSEL:16;
            } B;
        } LMSR;

        union {
            uint32_t R;
            struct {
                uint32_t:4;
                uint32_t HBSEL:28;
            } B;
        } HSR;

        union {
            uint32_t R;
            struct {
                uint32_t:10;
                uint32_t ADDR:19;
                  uint32_t:3;
            } B;
        } AR;

        union {
            uint32_t R;
            struct {

                uint32_t:9;
                uint32_t M6PFE:1;      /* Flexray */
                  uint32_t:1;

                uint32_t M4PFE:1;      /* FEC */

                uint32_t M3PFE:1;
                uint32_t M2PFE:1;
                uint32_t M1PFE:1;
                uint32_t M0PFE:1;
                uint32_t APC:3;
                uint32_t WWSC:2;
                uint32_t RWSC:3;

                uint32_t DPFEN:2;
                uint32_t IPFEN:2;

                uint32_t PFLIM:3;
                uint32_t BFEN:1;
            } B;
        } BIUCR;

        union {
            uint32_t R;
            struct {

                uint32_t:18;
                uint32_t M6AP:2;       /* Flexray */
                  uint32_t:2;

                uint32_t M4AP:2;       /* FEC */

