RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc556x.h
    typedef struct uMB_HEADER   /* message buffer header */
    {
        F_HEADER_t FRAME_HEADER;
        uint16_t DATA_OFFSET;
        S_STATUS_t SLOT_STATUS;
    } MB_HEADER_t;

/* Define memories */

#define SRAM_START  0x40000000
#define SRAM_SIZE      0x14000
#define SRAM_END    0x40013FFF

#define FLASH_START         0x0
#define FLASH_SIZE      0x200000
#define FLASH_END       0x1FFFFF

/* Define instances of modules */
#define PBRIDGE_A (*(volatile struct PBRIDGE_A_tag *) 0xC3F00000)
#define FMPLL     (*(volatile struct FMPLL_tag *)     0xC3F80000)
#define EBI       (*(volatile struct EBI_tag *)       0xC3F84000)
#define FLASH     (*(volatile struct FLASH_tag *)     0xC3F88000)
#define SIU       (*(volatile struct SIU_tag *)       0xC3F90000)

#define EMIOS     (*(volatile struct EMIOS_tag *)     0xC3FA0000)
#define ETPU      (*(volatile struct ETPU_tag *)      0xC3FC0000)
#define ETPU_DATA_RAM  (*( uint32_t *)        0xC3FC8000)
#define ETPU_DATA_RAM_EXT  (*( uint32_t *)    0xC3FCC000)
#define ETPU_DATA_RAM_END  0xC3FC89FC
#define CODE_RAM       (*( uint32_t *)        0xC3FD0000)
#define ETPU_CODE_RAM  (*( uint32_t *)        0xC3FD0000)

#define PBRIDGE_B (*(volatile struct PBRIDGE_B_tag *) 0xFFF00000)
#define XBAR      (*(volatile struct XBAR_tag *)      0xFFF04000)
#define ECSM      (*(volatile struct ECSM_tag *)      0xFFF40000)
#define EDMA      (*(volatile struct EDMA_tag *)      0xFFF44000)
#define INTC      (*(volatile struct INTC_tag *)      0xFFF48000)

#define EQADC     (*(volatile struct EQADC_tag *)     0xFFF80000)

#define DSPI_A    (*(volatile struct DSPI_tag *)      0xFFF90000)
#define DSPI_B    (*(volatile struct DSPI_tag *)      0xFFF94000)
#define DSPI_C    (*(volatile struct DSPI_tag *)      0xFFF98000)
#define DSPI_D    (*(volatile struct DSPI_tag *)      0xFFF9C000)

#define ESCI_A    (*(volatile struct ESCI_tag *)      0xFFFB0000)
#define ESCI_B    (*(volatile struct ESCI_tag *)      0xFFFB4000)

#define CAN_A     (*(volatile struct FLEXCAN2_tag *)  0xFFFC0000)
#define CAN_B     (*(volatile struct FLEXCAN2_tag *)  0xFFFC4000)
#define CAN_C     (*(volatile struct FLEXCAN2_tag *)  0xFFFC8000)
#define CAN_D     (*(volatile struct FLEXCAN2_tag *)  0xFFFCC000)
#define CAN_E     (*(volatile struct FLEXCAN2_tag *)  0xFFFD0000)

#define FEC     (*(volatile struct FEC_tag *)  0xFFF4C000)

#define FR     (*(volatile struct FR_tag *)  0xFFFE0000)

#ifdef __MWERKS__
#pragma pop
#endif

#ifdef  __cplusplus
}
#endif
#endif /* ASM */
#endif                          /* ifdef _MPC5567_H */
/*********************************************************************
 *
 * Copyright:
 *	Freescale Semiconductor, INC. All Rights Reserved.
 *  You are hereby granted a copyright license to use, modify, and
 *  distribute the SOFTWARE so long as this entire notice is
 *  retained without alteration in any modified and/or redistributed
 *  versions, and that such modified versions are clearly identified
 *  as such. No licenses are granted by implication, estoppel or
 *  otherwise under any patents or trademarks of Freescale
 *  Semiconductor, Inc. This software is provided on an "AS IS"
 *  basis and without warranty.
 *
 *  To the maximum extent permitted by applicable law, Freescale
 *  Semiconductor DISCLAIMS ALL WARRANTIES WHETHER EXPRESS OR IMPLIED,
 *  INCLUDING IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A
 *  PARTICULAR PURPOSE AND ANY WARRANTY AGAINST INFRINGEMENT WITH
 *  REGARD TO THE SOFTWARE (INCLUDING ANY MODIFIED VERSIONS THEREOF)
 *  AND ANY ACCOMPANYING WRITTEN MATERIALS.
 *
 *  To the maximum extent permitted by applicable law, IN NO EVENT
 *  SHALL Freescale Semiconductor BE LIABLE FOR ANY DAMAGES WHATSOEVER
 *  (INCLUDING WITHOUT LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS,
 *  BUSINESS INTERRUPTION, LOSS OF BUSINESS INFORMATION, OR OTHER
 *  PECUNIARY LOSS) ARISING OF THE USE OR INABILITY TO USE THE SOFTWARE.
 *
 *  Freescale Semiconductor assumes no responsibility for the
 *  maintenance and support of this software
 *
 ********************************************************************/
